//Написать программу, которая складывает два числа

Console.WriteLine("2Hello, World!");

